{
  "clerkAuth": {
    "loginSuccess": {
      "action": "Continue Session",
      "desc": "{{greeting}}, it's great to have you back. Let's pick up where we left off.",
      "title": "Welcome back, {{nickName}}"
    }
  },
  "error": {
    "backHome": "Back to Home",
    "desc": "Please try again later, or return to a known world.",
    "retry": "Reload",
    "title": "Oops, something went wrong."
  },
  "fetchError": "Request Failed",
  "fetchErrorDetail": "Error Details",
  "notFound": {
    "backHome": "Back to Home",
    "desc": "We couldn't find the page you were looking for. Please check if the link is correct.",
    "title": "Into the Unknown Territory?"
  },
  "pluginSettings": {
    "desc": "Complete the following configuration to start using this plugin.",
    "title": "{{name}} Plugin Settings"
  },
  "response": {
    "400": "Sorry, the server does not understand your request. Please check that your request parameters are correct.",
    "401": "Sorry, the server has denied your request, possibly due to insufficient permission or an invalid authentication.",
    "403": "Sorry, the server has denied your request. You do not have permission to access this content.",
    "404": "Sorry, the server could not find the page or resource you requested. Please check that the URL is correct.",
    "405": "Sorry, the server does not support the request method you used. Please check that your request method is correct.",
    "406": "Sorry, the server cannot complete the request due to the content characteristics of your request.",
    "407": "Sorry, you need to authenticate with the proxy before continuing this request.",
    "408": "Sorry, the server has timed out while waiting for the request. Please check your network connection and try again.",
    "409": "Sorry, there is a conflict in the request that cannot be processed, possibly due to incompatible resource status and request.",
    "410": "Sorry, the resource you requested has been permanently removed and cannot be found.",
    "411": "Sorry, the server cannot process a request that does not include a valid content length.",
    "412": "Sorry, your request does not meet the conditions of the server and cannot be completed.",
    "413": "Sorry, your request is too large for the server to process.",
    "414": "Sorry, your requested URI is too long for the server to process.",
    "415": "Sorry, the server cannot process the media format attached to the request.",
    "416": "Sorry, the server cannot satisfy the range you requested.",
    "417": "Sorry, the server cannot meet your expectations.",
    "422": "Sorry, your request format is correct, but it cannot be responded to due to semantic errors.",
    "423": "Sorry, the resource you requested is locked.",
    "424": "Sorry, the previous request failed, leading to the inability to complete the current request.",
    "426": "Sorry, the server requires your client to upgrade to a higher protocol version.",
    "428": "Sorry, the server requires a precondition and requires that your request include the correct conditional header.",
    "429": "Sorry, your request is too frequent and the server is tired. Please try again later.",
    "431": "Sorry, your request header field is too large for the server to process.",
    "451": "Sorry, the server refuses to provide this resource due to legal reasons.",
    "500": "Sorry, the server seems to have encountered some difficulties and cannot complete your request temporarily. Please try again later.",
    "502": "Sorry, the server seems to be lost and unable to provide service temporarily. Please try again later.",
    "503": "Sorry, the server cannot process your request at the moment. This may be due to overload or maintenance. Please try again later.",
    "504": "Sorry, the server did not wait for a response from the upstream server. Please try again later.",
    "AgentRuntimeError": "Lobe AI Runtime Execution error. Please troubleshoot according to the following information and try again.",
    "AnthropicBizError": "An error occurred while requesting Anthropic AI service. Please troubleshoot according to the following information.",
    "AzureBizError": "An error occurred while requesting Azure AI service. Please troubleshoot or retry according to the following information.",
    "BedrockBizError": "An error occurred while requesting Bedrock service. Please troubleshoot or retry according to the following information.",
    "DeepSeekBizError": "An error occurred while requesting DeepSeek service. Please troubleshoot or retry according to the following information.",
    "GoogleBizError": "An error occurred while requesting Google service. Please troubleshoot or retry according to the following information.",
    "GroqBizError": "An error occurred while requesting Groq service. Please troubleshoot according to the following information.",
    "InvalidAccessCode": "The password is incorrect or empty. Please enter the correct access password or add a custom API Key.",
    "InvalidAnthropicAPIKey": "Anthropic API Key is incorrect or empty. Please check the Anthropic API Key and try again.",
    "InvalidAzureAPIKey": "Azure API Key is incorrect or empty. Please check the Azure API Key and try again.",
    "InvalidBedrockCredentials": "Bedrock authentication failed. Please check AccessKeyId/SecretAccessKey and try again.",
    "InvalidClerkUser": "Sorry, you are currently not logged in. Please login or register an account before continuing.",
    "InvalidDeepSeekAPIKey": "DeepSeek API Key is incorrect or empty. Please check the DeepSeek API Key and try again.",
    "InvalidGoogleAPIKey": "Google API Key is incorrect or empty. Please check the Google API Key and try again.",
    "InvalidGroqAPIKey": "Groq API Key is incorrect or empty. Please check the Groq API Key and try again.",
    "InvalidMinimaxAPIKey": "Minimax API Key is incorrect or empty. Please check the Minimax API Key and try again.",
    "InvalidMistralAPIKey": "Mistral AI API Key is incorrect or empty. Please check the Mistral API Key and try again.",
    "InvalidMoonshotAPIKey": "Moonshot AI API Key is incorrect or empty. Please check the Moonshot API Key and try again.",
    "InvalidOllamaArgs": "The Ollama configuration is incorrect. Please check the Ollama configuration and try again.",
    "InvalidOpenRouterAPIKey": "OpenRouter API Key is incorrect or empty. Please check the OpenRouter API Key and try again.",
    "InvalidPerplexityAPIKey": "Perplexity API Key is incorrect or empty. Please check the Perplexity API Key and try again.",
    "InvalidTogetherAIAPIKey": "TogetherAI API Key is incorrect or empty. Please check the TogetherAI API Key and try again.",
    "InvalidZeroOneAPIKey": "ZeroOne API Key is incorrect or empty. Please check the ZeroOne API Key and try again.",
    "InvalidZhipuAPIKey": "Zhipu API Key is incorrect or empty. Please check the Zhipu API Key and try again.",
    "LocationNotSupportError": "Sorry, the model service is not available in your location, possibly due to regional restrictions or the service is not open. Please confirm whether the current location supports using this service or try changing to another location to retry.",
    "MinimaxBizError": "An error occurred while requesting Minimax service. Please troubleshoot according to the following information.",
    "MistralBizError": "An error occurred while requesting Mistral AI service. Please troubleshoot or retry according to the following information.",
    "MoonshotBizError": "An error occurred while requesting Moonshot service. Please troubleshoot or retry according to the following information.",
    "NoOpenAIAPIKey": "OpenAI API Key is empty. Please add a custom OpenAI API Key.",
    "OllamaBizError": "An error occurred while requesting Ollama service. Please troubleshoot according to the error information below and try again.",
    "OllamaServiceUnavailable": "The Ollama service connection failed. Please check whether Ollama is running normally or whether the cross-domain configuration of Ollama is set correctly.",
    "OpenAIBizError": "An error occurred while requesting OpenAI service. Please troubleshoot or retry according to the following information.",
    "OpenRouterBizError": "An error occurred while requesting OpenRouter AI service. Please troubleshoot according to the following information.",
    "PerplexityBizError": "An error occurred while requesting Perplexity AI service. Please troubleshoot according to the following information.",
    "PluginApiNotFound": "Sorry, the API does not exist in the plugin description manifest. Please check whether your request method matches the plugin API in the manifest.",
    "PluginApiParamsError": "Sorry, the input parameter verification of the plugin request has failed. Please check whether the input parameter matches the API description information of the plugin.",
    "PluginGatewayError": "Sorry, there is an error with the plugin gateway. Please check whether the plugin gateway configuration is correct.",
    "PluginManifestInvalid": "Sorry, the plugin's manifest verification failed. Please check whether the description manifest format is standardized.",
    "PluginManifestNotFound": "Sorry, the server did not find the manifest.json file of the plugin. Please check whether the plugin description file address is correct.",
    "PluginMarketIndexInvalid": "Sorry, the plugin index verification failed. Please check whether the index file format is standardized.",
    "PluginMarketIndexNotFound": "Sorry, the server did not find the plugin index. Please check if the index address is correct.",
    "PluginMetaInvalid": "Sorry, the plugin's meta information verification has failed. Please check whether the plugin meta information format is standardized.",
    "PluginMetaNotFound": "Sorry, the plugin configuration information was not found in the index.",
    "PluginOpenApiInitError": "Sorry, the OpenAPI client initialization failed. Please check whether the OpenAPI configuration information is correct.",
    "PluginServerError": "The plugin server request has returned an error. Please check your plugin description file, plugin configuration or server-side implementation based on the following error information.",
    "PluginSettingsInvalid": "This plugin can only be used after correct configuration. Please check whether your configuration is correct.",
    "TogetherAIBizError": "An error occurred while requesting TogetherAI AI service. Please troubleshoot according to the following information.",
    "ZeroOneBizError": "An error occurred while requesting ZeroOne service. Please troubleshoot according to the following information.",
    "ZhipuBizError": "An error occurred while requesting Zhipu service. Please troubleshoot or retry according to the following information."
  },
  "stt": {
    "responseError": "Service request failed, please check configuration or retry."
  },
  "tts": {
    "responseError": "Service request failed, please check configuration or retry."
  },
  "unlock": {
    "addProxyUrl": "Add OpenAI proxy address (optional)",
    "closeMessage": "Close prompt",
    "confirm": "Confirm and retry",
    "oauth": {
      "description": "The administrator has enabled unified login authentication. Click the button below to log in and unlock the app.",
      "success": "Login successful",
      "title": "Login Account",
      "welcome": "Welcome!"
    },
    "ollama": {
      "cancel": "Cancel download",
      "confirm": "Download",
      "description": "Enter your Ollama model tag to continue the session.",
      "downloaded": "{{completed}} / {{total}}",
      "starting": "Start downloading...",
      "title": "Download specified Ollama model."
    },
    "password": {
      "buy": "Buy to Unlock App",
      "description": "The password only needs to be filled in once. The password is for personal use only. If you share the KEY with other users or log in remotely multiple times, your account will be blocked.",
      "placeholder": "Please enter password",
      "title": "Enter password to unlock app."
    },
    "tabs": {
      "apiKey": "Custom API Key",
      "buy": "Buy",
      "password": "Purchase"
    }
  },
  "upload": {
    "desc": "Details: {{detail}}",
    "title": "File upload failed, please check network connection or try again later."
  }
}
